[{
  "_id": "prod_002",
  "name": "Covered Litter Box",
  "category": "Cat Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "Give your feline friend privacy and keep odors contained with this spacious covered litter box. The removable hood provides easy access for cleaning, while the built-in door flap helps reduce litter tracking. Features a durable plastic construction that's easy to clean and maintain. The generous interior space accommodates cats of all sizes comfortably. Includes a replaceable charcoal filter to help control odors naturally.",
  "image": "product/covered-litter-box.png",
  "featured": "true"
},
{
  "_id": "prod_004",
  "name": "Harness",
  "category": "Dog Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "A versatile, everyday harness designed for comfort and control. This harness features breathable mesh panels to keep your pet cool during walks and activities. The step-in design makes it easy to put on, while reflective stitching improves visibility during evening walks. Suitable for dogs of various sizes with fully adjustable straps that grow with your pet. Built to last with reinforced stress points and quality hardware.",
  "image": "product/harness.png",
  "featured": "true"
},
{
  "_id": "prod_007",
  "name": "Large Breed Dog Bed",
  "category": "Dog Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "Give your large breed companion the comfort they deserve with this spacious, supportive bed. Designed specifically for bigger dogs, this bed provides ample room to stretch out and features extra cushioning for joint support. The removable, machine-washable cover makes maintenance easy while the non-slip bottom keeps the bed in place. Durable construction withstands heavy use while maintaining its shape and support over time.",
  "image": "product/large-breed-dog-bed.png",
  "featured": "true"
},
{
  "_id": "prod_008",
  "name": "Large Fish Tank",
  "category": "Aquarium & Fish Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "Create an impressive aquatic display with this spacious large fish tank. Perfect for community fish setups or larger species that need room to swim and explore. The crystal-clear glass construction provides excellent viewing from all angles while the sturdy frame ensures long-lasting durability. Includes pre-drilled holes for easy filter and heater installation. Ideal for experienced aquarists looking to create a substantial underwater ecosystem.",
  "image": "product/large-fish-tank.png",
  "featured": "true"
},
{
  "_id": "prod_012",
  "name": "Nail Trimmers",
  "category": "Grooming & Health",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "Keep your pet's nails healthy and properly trimmed with these professional-grade nail clippers. Features sharp, stainless steel blades that make clean cuts without crushing or splitting nails. The ergonomic handle provides a secure grip and comfortable control during grooming sessions. Includes a safety guard to prevent over-cutting and reduce the risk of injury. Suitable for dogs and cats of all sizes with durable construction that maintains its sharpness over time.",
  "image": "product/nail-trimmers.png",
  "featured": "true"
},
{
  "_id": "prod_013",
  "name": "Premium Dog Food",
  "category": "Dog Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "Treat your dog to restaurant-quality nutrition with this premium dog food formula. Crafted with high-quality proteins, wholesome grains, and fresh vegetables to provide complete and balanced nutrition. Enhanced with probiotics for digestive health and omega fatty acids for a shiny coat and healthy skin. This formula is carefully balanced to meet the nutritional needs of active dogs while being gentle on sensitive stomachs.",
  "image": "product/premium-dog-food.png",
  "featured": "true"
},
{
  "_id": "prod_014",
  "name": "Red Spinner Cat Toy",
  "category": "Cat Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "Watch your cat go wild for this vibrant red spinner toy that moves unpredictably to mimic prey. The spinning action engages your cat's hunting instincts while providing excellent exercise and mental stimulation. Lightweight design allows cats to bat, pounce, and carry the toy around. Made with safe, pet-friendly materials and colors. Great for solo play or interactive sessions with your cat.",
  "image": "product/red-spinner-cat-toy.png",
  "featured": "true"
},
{
  "_id": "prod_005",
  "name": "Interactive Cat Toy",
  "category": "Cat Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "Keep your cat mentally stimulated and physically active with this engaging interactive toy. Designed to trigger your cat's natural hunting instincts, this toy features moving parts and textures that encourage play and exploration. Made from safe, non-toxic materials that can withstand enthusiastic play sessions. Perfect for indoor cats who need extra stimulation or as a way to keep your pet entertained when you're away.",
  "image": "product/interactive-cat-toy.png",
  "featured": "true"
},
{
  "_id": "prod_011",
  "name": "Medium Fish Tank",
  "category": "Aquarium & Fish Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "The perfect starter tank for new fish enthusiasts or an ideal upgrade for growing collections. This medium-sized tank provides ample space for a variety of fish species while remaining manageable for regular maintenance. Features high-quality glass construction with polished edges for safety and a professional appearance. The versatile size works well for both freshwater and saltwater setups, making it a great choice for aquarists of all experience levels.",
  "image": "product/medium-fish-tank.png",
  "featured": "true"
},
{
  "_id": "prod_001",
  "name": "Clicker",
  "category": "Training & Behavior",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "Make training sessions more effective with this professional-grade clicker. The crisp, consistent sound helps reinforce positive behaviors in dogs, cats, and other pets through clear communication. Features an ergonomic design that fits comfortably in your hand and a reliable clicking mechanism that produces the same sound every time. Perfect for obedience training, trick teaching, and behavior modification. Includes a wrist strap for easy carrying during training sessions.",
  "image": "product/clicker.png",
  "featured": "true"
},
{
  "_id": "prod_003",
  "name": "Dog Harness",
  "category": "Dog Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "Ensure comfortable, secure walks with this adjustable dog harness. Distributes pressure evenly across your dog's chest instead of concentrating it on the neck, making walks more comfortable and reducing strain on the throat. Features quick-release buckles for easy on and off, plus multiple adjustment points for a customized fit. The durable construction can handle pulling while the soft padding prevents chafing during longer walks.",
  "image": "product/dog-harness.png",
  "featured": "true"
},
{
  "_id": "prod_006",
  "name": "Kibble Dog Food",
  "category": "Dog Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "Provide your dog with balanced nutrition with this premium kibble formula. Made with real meat as the first ingredient and fortified with essential vitamins and minerals to support your dog's overall health. The crunchy texture helps maintain dental health by reducing plaque and tartar buildup. Suitable for adult dogs of all sizes and activity levels. Free from artificial colors, flavors, and preservatives.",
  "image": "product/kibble-dog-food.png",
  "featured": "true"
},
{
  "_id": "prod_010",
  "name": "Litter Box",
  "category": "Cat Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "A reliable, no-fuss litter box that gets the job done. This open-top design makes it easy for cats to enter and exit while providing simple access for daily cleaning. Made from durable, non-porous plastic that resists odors and stains. The smooth interior surface prevents litter from sticking and makes cleaning quick and effortless. Ideal for cats who prefer an open bathroom experience or as a secondary litter box for multi-cat households.",
  "image": "product/litter-box.png",
  "featured": "true"
},
{
  "_id": "prod_015",
  "name": "Small Fish Tank",
  "category": "Aquarium & Fish Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "An ideal beginner's tank or perfect for smaller fish species and desktop displays. This compact tank is easy to set up and maintain while still providing a healthy environment for your aquatic pets. The clear glass construction offers excellent visibility of your fish and decorations. Great for bettas, small tropical fish, or as a quarantine tank for new additions to your aquarium collection.",
  "image": "product/small-fish-tank.png",
  "featured": "true"
},
{
  "_id": "prod_009",
  "name": "Leash",
  "category": "Dog Care",
  "brand": "Generic",
  "price": 9.99,
  "inStock": true,
  "description": "A dependable leash for daily walks and training sessions. Features a comfortable padded handle that won't dig into your hands during longer walks or if your dog pulls. The strong, weather-resistant material can handle dogs of various sizes while the secure clasp ensures your pet stays safely connected. Available in a standard 6-foot length that provides the right balance of freedom and control for most walking situations.",
  "image": "product/leash.png",
  "featured": "true"
}]